##실습 2) 온라인 주문 데이터 분석
##2021년 6월 1일 하루동안의 주문 건

##1. 데이터 탐색 ##############################
## 비회원 주문 : userid null, 

##a) 주문 테이블


##b) 상품 테이블


##c) 카테고리 테이블



##d) 유저 테이블



##2. TOP 상품의 매출 확인

##상품별 매출액 집계 후, 매출액 높은 순으로 정렬하기



##상품이름을 상품ID와 나란히 놓아서 한눈에 상품별 매출액을 확인할 수 있도록 하자.



##추가질문: 카테고리별 매출액은 어떻게 될까?
### 2중 join 하여 특정 컬럼만 보기



##Join 테이블에 Join을 한번 더


##추가질문: 성/연령별 매출액은 어떻게 될까?



##나이대별 출과 사용자수는 어떻게 될까?



##3. 카테고리별 주요 상품의 매출 확인



##추가질문: 남성이 구매하는 아이템은 어떤 것이 있을까?



##추가질문: 남성의 나이대별 구매하는 아이템은 어떤 것이 있을까?

